/**
 * @file lib.h
 * @brief Файл з розміром вхідного масиву та прототипами функцій
 *
 * @author Vysotskyi O.
 * @date 16-jan-2021
 * @version 1.0
 */

#pragma once
#include <stdlib.h>
#include <time.h>

#define N 3
/**
 * Кількість чисел вхідного масиву N * N
 */
 
void fillingArr(int *pArr);
/**
 * Заповнення вхідного масиву випадковими числами
 *
 * Функція заповнює вхідний масив випадковими числами з заданого діапазону за допомогою функції rand()
 */
 
void mainDiagonal(int *pResult, int *pArr);
/**
 * Заповнення результуючого масиву
 *
 * Функція заповнює результуючий масив елементами головної діагоналі вхідного масиву
 */
 
void sort(int *pResult);
/**
 * Сортування елементів результуючого масиву
 *
 * Функція сортує елементи результуючого масиву у порядку зростання методом бульбашки
 */
