#define N1 12 
#define N2 36 // задані два числа
int main() {
	int a;
	int b;
	int result_for;
	int result_while;
	int result_do;
	
	for (a = N1, b = N2; a > 0 && b > 0;) // ділення з остачою більшого числа на менше, доки остача не буде 0 (алгоритм Евкліда) 
		{
		(a > b) ? (a %= b) : (b %= a);
		result_for = a + b;
		}
	a = N1; // щоб зайти у новий цикл, треба відновити значення чисел до початкових
	b = N2;
	
	while (a > 0 && b > 0)  // ділення з остачою більшого числа на менше, доки остача не буде 0 (алгоритм Евкліда) 
		{
		(a > b) ? (a %= b) : (b %= a);
		result_while = a + b;
		}
	a = N1; // щоб зайти у новий цикл, треба відновити значення чисел до початкових
	b = N2;
	
	do { // ділення з остачою більшого числа на менше, доки остача не буде 0 (алгоритм Евкліда) 
		(a > b) ? (a %= b) : (b %= a);
		result_do = a + b;
	} while (a > 0 && b > 0);
	
return 0;
}
