#include <stdlib.h>
#include <time.h>

/**
 * @mainpage
 * # Загальне завдання
 * **Переробити** програми, що були розроблені під час виконання лабораторних робіт з теми «Масиви» таким чином, щоб використовувалися функції для обчислення результату.
 *
 * # Індивідуальне завдання
 * **Заповнити** масив із заданої кількості елементів простими числами, що не повторюються. Розмір вихідного масиву задати наперед відомим значенням, що може бути більшим аніж результуюча кількість отриманих елементів.
 *
 * @author Vysotskyi O.
 * @date 13-jan-2021
 * @version 1.0
 */

#define N 10 // розмір вихідного масиву
void get_prime_numbers (int start, int end, int prime_numbers[]); // функція пошуку простих чисел у діапазоні

/**
 * @param start -  початок діапазону, заданий випадковим числом
 * @param end - кінець діапазону, заданий випадковим числом
 * @param prime_numbers[] - масив простих чисел
 * @param N - розмір масиву
*/
int main() { /**Функція main: за допомогою функції rand генерує випадкове значення початку й кінця діапазону, у якому буде пошук простих чисел. Викликає функцію get_prime_numbers*/
	srand(time(NULL));
	
	int start = rand() % 100; // початок діапазону, заданий випадковим числом
	int end = rand() % 100 + 100; // кінець діапазону, заданий випадковим числом
	
	int prime_numbers[N] = {0}; // масив простих чисел
	
	get_prime_numbers (start, end, prime_numbers);
	
	return 0;
}

void get_prime_numbers (int start, int end, int prime_numbers[N]) { /**Функція get_prime_numbers: перевіряє кожне число діапазону за допомогою циклу for. Кожне знайдене просте число записується у масив, розмір якого заздалегідь задано*/
	int j = 0;
	for (int num = start; num <= end; num++) { // перевірка кожного числа заданого діапазону
		int check = 0;	
		for (int i = 2; i < num; i++) {
			if (num % i == 0) { // якщо число ділиться хоча б на одне число, менше від нього, воно є складеним
				break;
			}
			if (i == num - 1) { // якщо число не поділилося на жодне число, менше від нього, воно є простим
				prime_numbers[j] = num;
				j++;
			}
		}
	}
}
